# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO11-obb + Coverage-Aware + Refine Head (宽度/角度精修分支)
# 基于 yolo11-obb-ca.yaml，将检测头从 OBB 替换为 OBBRefine：
#   - 保留原有 DFL box + cls + angle 分支不变
#   - 新增 cv5 轻量精修分支，预测 [Δw, Δh, Δθ]（ne_refine=3）
#   - 绕过 DFL 离散化瓶颈，直接用连续回归修正短边宽度和角度
#   - 零初始化 → 训练开始时等价于纯 CA 模型

# Parameters
nc: 80 # number of classes
reg_max: 32 # Maximum DFL channels
scales: # model compound scaling constants, i.e. 'model=yolo11n-obb-ca-refine.yaml' will call yolo11-obb-ca-refine.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: YOLO11n-obb-ca-refine
  s: [0.50, 0.50, 1024] # summary: YOLO11s-obb-ca-refine
  m: [0.50, 1.00, 512] # summary: YOLO11m-obb-ca-refine
  l: [1.00, 1.00, 512] # summary: YOLO11l-obb-ca-refine
  x: [1.00, 1.50, 512] # summary: YOLO11x-obb-ca-refine

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, False]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, OBBRefine, [nc, 1, 3]] # OBBRefine(P3, P4, P5): ne=1(angle), ne_refine=3([Δw,Δh,Δθ])
